# 전수조사와 표본조사

# 전수조사
# 모집단 내에 모든 대상을 조사
# 모집단의 특성을 정확하게 반영할 수 있지만 시간과 비용이 많이 소요된다.

# 표본조사
# 모집단으로부터 추출된 표본을 대상으로 조사
# 전수조사보다 시간과 비용을 절약할 수 있지만 모집단의 특성을 반영하는 표본이 추출되지 못할시 수집된 자료가 무용지물이 된다.

# 모집단 -> 관찰 대상이 되는 개체의 전체집합
# 표본 -> 모집단에서 조사대상으로 추출된 부분집합


# 통계적 추정

# 점 추정
# 모집단의 특성을 하나의 값으로 추정
# 모수 (모집단의 평균, 분산 ...) 와 동일할 가능성이 가장 큰 하나의 값을 선택하므로 가능성이 희박

# 구간 추정
# 모집단의 특성을 적절한 구간을 이용하여 추정
# 모수가 속하는 이정 구간 (하한값이나 상한값) 으로 추정하기에 일반적으로 많이 사용 됨.

# 신뢰수준 -> 계산된 구간이 모수에 포함될 확률
# 신뢰구간 -> 신회수준 하에서 모수를 포함하는 구간
# 표본오차 -> 표본이 모집단의 특성과 정확히 일치하지 않아 발생하는 확률의 차이


# 기각역과 채택역

# 임계값 -> 귀무가설이 타당하면 귀무가설 채택하고 연구가설이 타당하면 귀무가설을 기각하게 되는데 그 기준이 되는 값
# 채택역 -> 임계값을 기준으로 채택이 되는 범위
# 기각역 -> 임계값을 기준으로 기각이 되는 범위


# 양측 검정과 단측 검정

# 양측 검정
# 귀무가설이 방향성(어느 한쪽이 많고 적음) 이 없는 경우 적용
# 이때 연구가설로 똑같이 방향성이 없는 가설과 방향성을 갖는 형식의 가설로 검정

# 단측 검정
# 방향성이 있는 가설의 경우 적용
# 이때 연구가설로 한쪽이 작다 혹은 크다 두가지 형식으로 검정


# 가설검정 오류

# 귀무가설이 참인데 연구가설을 채택할 경우 -> 제 1종 오류
# 연구가설이 참인데 귀무가설을 채택할 경우 -> 제 2종 오류

# 귀무가설의 기각역을 작게하면 제 1종 오류는 적어지지만 제 2종 오류가 많아짐
# 귀무가설의 기각역을 크게하면 제 2종 오류는 적어지지만 제 1종 오류가 많아짐


# 검정 통계량
# 가설을 검정하기 위해 수집된 데이터로부터 계산된 통계량 == 기각역을 결정하는 기준
# 유의수준의 alpha 값과 비교하여 기각 혹은 채택의 여부를 결정


# 정규분포
# 도수분포곡선이 평균값을 중앙으로 햐여 좌우대칭인 종 모양을 이루는 것
# 가우스곡선


# 모수와 비모수 검정

# 모수 검정
# 관측값이 어느 특정한 확률분포를 따른다고 전제하고 그 분포의 모수에 대한 검정을 시행
# 보통은 중심 극한 정리에 의해 케이스가 30개 이상이면 정규분포를 따른다는 전제를 두고 검정을 시행

# 비모수 검정
# 관측값이 어느 특정한 확률분포를 따른다고 전제할 수 없는 경우에 실시


# 표준 정규분포
# 정규분포의 평균을 0, 표준편차를 1로 고정하여 표준화한 정규분포
# 정규분포의 신뢰구간을 구할 때 이용


# 표준화 변수 ( Z )
# 정규분포의 특정 확률변수를 구하기 위해 표준정규분포로 바꾸는 변수


# 왜도
# 평균을 중심으로 한 확률분포의 비대칭 정도
# 왜도 > 0 -> 왼쪽으로 치우침
# 왜도 < 0 -> 오른쪽으로 치우침

# 첨도
# 표준정규분포에 비해 얼마나 뾰족한가
# 첨도 > 0 or 3 -> 뾰족
# 첨도 = 0 or 3 -> 정규분포 곡선
# 첨도 < 0 or 3 -> 완만
